app/views/armas/index.html.haml

SELECT tags.*, taggings.tags_count AS count FROM `tags` JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM `taggings` INNER JOIN armas ON armas.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Arma' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT armas.id FROM `armas` )) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id
---
            %br/
            = raw arma.tag_list.map { |t| link_to t, tag_path(t) }.join(', ')