app/controllers/armas_controller.rb

SELECT `armas`.* FROM `armas` JOIN taggings armas_taggings_fb000ca ON armas_taggings_fb000ca.taggable_id = armas.id AND armas_taggings_fb000ca.taggable_type = 'Arma' AND armas_taggings_fb000ca.tag_id = 6
SELECT tags.*, taggings.tags_count AS count FROM `tags` JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM `taggings` INNER JOIN armas ON armas.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Arma' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT armas.id FROM `armas` )) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id
---
  def index
 if params[:tag]
    @armas = Arma.tagged_with(params[:tag])
  else
    @armas = Arma.all

SELECT `armas`.* FROM `armas` WHERE `armas`.`id` = 1 LIMIT 1
---
  def show
    @arma = Arma.find(params[:id])

SELECT `armas`.* FROM `armas` WHERE `armas`.`id` = 1 LIMIT 1
---
  def edit
    @arma = Arma.find(params[:id])

INSERT INTO `armas` (`created_at`, `descricao`, `historico`, `marca`, `modelo`, `updated_at`) VALUES ('2013-02-20 19:12:11', 'Peso: 14,5 kg\r\nTamanho: 145cm (56 polegadas)\r\nTamanho do cano: 39 polegadas (73,7 cm)\r\nMunição: .50 BMG\r\nAção: semi-automatico,\r\nVelocidade do projétil ao sair do cano: 853m/s, isto é, 3.070Km/h\r\nDistância letal: 1.850m\r\nDistância máxima: 6.800m', 'Barrett M107 - é um fuzil de alta potência para atiradores de elite/snipers, usado pelas Forças Armadas dos EUA.\r\nO fuzil M107 foi usado pela segunda vez por tropas norte-americanas na Operação Tempestade no Deserto. O M107 dispara uma potente munição calibre 50, que foi utilizada durante muito tempo como a munição padrão de metralhadoras pesadas.\r\nCom um alcance efetivo de mais de 1.850 metros, e um incrível poder de impacto, o fuzil se mostrou eficiente contra múltiplos alvos , inclusive soldados, veículos e aeronaves . A versão padrão do M107 vem com mira telescópica e suporte de dois pés, que juntos aumentam a precisão durante os disparos. O design da arma e seu cano retrátil minimizam o recuo (mas ainda assim o coice é forte) , enquanto a ação semiautomática de 10 tiros permite ao atirador concentrar-se em um alvo através de tiros simultâneos.', 'Barrett Firearms Manufacturing', 'Barrett M107', '2013-02-20 19:12:11')
---
  def create
    @arma = Arma.new(params[:arma])

    respond_to do |format|
      if @arma.save

SELECT `armas`.* FROM `armas` WHERE `armas`.`id` = 1 LIMIT 1
UPDATE `armas` SET `descricao` = 'Tipo: Rifle de Assalto\r\nPeso: 3,8 kg (descarregada) 4,3 kg (carregada)\r\nComprimento: 870 mm\r\nComprimento do cano: 415 mm\r\nCalibre: 7,62 x 39 mm\r\nAção: gás\r\nCadência de tiro: 600 tpm\r\nVelocidade de saída: 721m/s\r\nAlcance efetivo: 300 m\r\nSistema de suprimento: carregadores de 20, 30 ou 90 munições\r\nMira: alça regulável e ponto de mira', `updated_at` = '2013-02-20 14:46:57' WHERE `armas`.`id` = 1
---
  def update
    @arma = Arma.find(params[:id])

    respond_to do |format|
      if @arma.update_attributes(params[:arma])